[
    {
      "title": "Rimworld",
      "id": "rimworld",
      "date": "March 23, 2024",
      "shortDescription": "A complex story-generator disguised as a survival-sim colony-builder.\nWhile it's graphics are not outstanding, the simplified artstyle allows for very unique interactions.",
      "images": [
        {
          "url": "/rimworld_1.jpg",
          "title": "Rimworld title image, showcasing the different storytellers."
        },
        {
          "url": "/rimworld_2.jpg",
          "title": "A rimworld colony under the attack of mechanoids, its in shambles and burning."
        },
        {
          "url": "/rimworld_3.jpg",
          "title": "A rimworld screenshot of a colony under attack, its showcasing the medical tab."
        },
        {
          "url": "/rimworld_4.jpg",
          "title": "A rimworld screenshot of a colony under attack, with colonists hiding behind cover."
        },
        {
          "url": "/rimworld_5.jpg",
          "title": "A rimworld screenshot of a colony in building process. Theres several unfinished wooden houses."
        },
        {
          "url": "/rimworld_6.jpg",
          "title": "A rimworld screenshot of a colony under mechanoid attack, theres several laser beams soaring across the screen."
        },
        {
          "url": "/rimworld_7.jpg",
          "title": "A rimworld screenshot of a colony using mechanoids as worker robots."
        }
      ],
      "entries": [
        {
          "title": "Story",
          "description": "You can start from many different pre-defined or custom starts, but in almost all of them your colonists strand on the Rimworld, a planet which is both hostile and comfy at times. Depending on the beginning you chose, you start out with either no items, or a helpful starter set of goods. Your goal will be to build up your colony, survive raids and other dangerous events to eventually leave this planet again.\nThe different expansions added more win-conditions later on, like royal ascension and other neat things"
        },
        {
          "title": "Gameplay",
          "description": "Rimworld is way too complex to talk about all gameplay shenanigans here, but I will focus on some of the key aspects.\n\nYou are not playing as one colonist, but you are indirectly controlling all of them. The most influence on their behavior is the schedule and tasks priority you set for them, but you can also force them to do certain tasks or directly order them around if you set them to combat mode. Every colonist has various skills which include Shooting, Melee, Construction, Mining, Cooking, Plants, Animals, Crafting, Artistic, Medical, Social and Intellectual. The better the colonist is in a certain skill, the better work they do at a task that requires said skill. By doing those tasks colonists gain experience in the respective skills which helps them improve their skill levels (ranging from 0 to 20). Some colonists might not be able to do certain work because of their background (how they grow up, what they were before they stranded on the rim). Other colonists might be passionate or REALLY passionate in a skill which makes them improve that skill faster.\n\nOne of your tasks will be to balance the work priorities so your colony works most efficient, how you use your time is a key factor of success. In the beginning you can choose one of 3 story tellers which all have a different approach to when they start certain events, and they won't wait for you to build up! You will always have to be ready to fight when armies of different factions try to attack and rob your colony in raids. Thats where combat and the unique health system of Rimworld comes into play. If you look at the 3rd image in the left, you can see different effects that the battle had on the body of that colonist, and its insanely detailed. Instead of just having HP, every body part can be damaged individually. With a lucky shot to the brain, even your most beefy colonist can be taken down in one hit.\n\nThrough mining, crafting, researching and building you slowly become more wealthy. You can trade and organize raids yourself to profit from the riches of other factions. But no matter how rich you are, you will never be fully safe. The story tellers will level-up the threats to make sure it will not get boring in the later game. At some point you will be able to venture to a stranded space ship, or build your own and escape from the Rimworld."
        },
        {
          "title": "Why I love this game",
          "description": "I first got into this game in 2019 and now have over 500h. I come back to it from time to time and theres always one thing guaranteed: I will learn something new or experience something new, something I have never seen in the game before. All of the complex system intertwine to create a constant flow of interesting and unique interactions. Every colony you create will somehow have new twists, you will always have new stories to tell.\n\nOne time I was pretty good, wealthy, was able to fend off raids consistently. But then while mining I wasnt attentive enough, I mined away a load bearing piece of stone... And the cave floor collapsed on two of my colonists. They were just GONE, not even a corpse you could bury, just gone from one to the other moment...\n\nAnother time I had a start called 'Naked Brutality', where you start off with literally nothing. And I chose to only have ONE colonist. You will have to feed on berries till you get your agriculture rolling and since just having one colonist means you have many skills not covered... Its a difficult challenge. I started in the tropical area and my colonist happened to be good at taming animals, so I let them tame 2 elephants. And from then on these 2 elephants protected me from raids so I was able to focus on the colony and get everything rolling. Even with the worst start, you can always find a way to get an advantage in this game.\n\nOverall I really love the progression, slowly building up your colony while getting more and more colonists and fending off raids or other events... It's an experience no other game gave me before."
        }
      ]
    },
    {
      "title": "ASTRONEER",
      "id": "astroneer",
      "date": "March 24, 2024",
      "shortDescription": "A space exploration survival game where you can reshape the world to your will.",
      "images": [
        {
          "url": "/astroneer_1.jpg",
          "title": "Astroneer title image, showing 3 astronauts exploring a diverse landscape."
        },
        {
          "url": "/astroneer_2.jpg",
          "title": "A screenshot from Astroneer showing an astroneer walking on a purple-ish planet with purple grass, around him theres some scrap, trees and other plants."
        },
        {
          "url": "/astroneer_3.png",
          "title": "A screenshot from Astroneer showing a huge rover with alot of solar panels and storage, hauling some rocks for research."
        },
        {
          "url": "/astroneer_4.jpg",
          "title": "A screenshot from Astroneer showing a group of astronauts in very diverse suits running towards the right on a puple-pink-ish planet. You can see their base in the background."
        },
        {
          "url": "/astroneer_5.jpg",
          "title": "A screenshot from Astroneer showing an astronaut lookint towards the camera. They are on a moon, the ground is brown, in the background there is a rover and you can also see a mountain partially obstructing the sun."
        },
        {
          "url": "/astroneer_6.jpg",
          "title": "An artwork about Astroneer showing a planet core. Its dark purple with emmisive pink-ish details and looks very futuristic."
        }
      ],
      "entries": [
        {
          "title": "Gameplay",
          "description": "Astroneer is a very unique survival game where you can use your portable vacuum/drill to literally suck up dirt around you and spit it out again to build bridges, flatten terrain, etc. That way you can also harvest different resources, which are scattered around the planets. Harvested resources will go to your backpack, which is not like an inventory in the traditional sense. Instead of opening a seperate user interface like in other games, items are directly in one of the 10 slots in the backpack and you have to drag them out and place them where you want to use them. That way you constantly have to manage your inventory, which sounds like a drag, but it's actually a neat limitation. Later on you can unlock rovers or even trains (monorails) which help you transport more items at once.\n\nWhile exploring the world, there is another resource that limits your freedom: Oxygen. If you are not connected to your home base you constantly lose oxygen. If you're out of oxygen for too long you will die and respawn, leaving behind your backpack. You can craft so called 'tethers' to build oxygen lines from your base to wherever you want to go. There are also items like air filters which enable you to breathe longer without a connection, or even miniaturized oxygen generators, though they take up a lot of energy.\n\nAnd energy is the third resource you have to manage. Everything that does something automatic, be it the oxygen generator or the furnace, needs a constant power source. In the beginning you start out with generators that need a constant refill of resurces, later on you can 3D-print solar panels or wind generators. Since these do'nt generate a constant flow of energy, you will also need batteries to store their energy. The end game also provides RTG's, which are really expensive but output constant power without the need for light or wind."
        },
        {
          "title": "Progression",
          "description": "The progression in Astroneer is basically split in two.\n\nOn the one hand you have the resource progression. This is based on the fact that different planets have different resources available, these are minerals at the surface and in caves and gases in the atmosphere. So on the starting planet you will slowly build yourself up to building your first rocket and then you can choose your first destination depending on what you want to focus on first. You first might wanna go to a planet which provides iron so you can build more complex machinery, which also includes the chemistry lab for refining more complex items. Though you could also go to a planet which offers more copper to focus on extending your solar panels (which need a copper each). After that you might wanna go to a planet that offers lithium so you can build more batteries or a planet with titanium to make the end-tier items and buildings. There is many paths to choose from and they all feel pretty dynamic.\n\nOn the other hand you have the progression with the weird gateways. Every planet and moon has gateways scattered across the surface which you can activate by feeding them energy. You can travel between activated gateways in an instant, but they also bring another advantage: they unlock the core of the planet. If you try to drill to the core of a planet without activating any gateway on that planet you will soon reach a core which you can't enter from any side. Though this core will open up after activating one gateway, then you can enter it and by providing an item specific to that planet, you can activate the core. You can teleport from the core to activated gateways on the same planet and down again. But there is more to it I won't spoil here."
        },
        {
          "title": "Why I love this game",
          "description": "I have first played this game in 2018 and accumulated over 200h over the course of the years. I always find myself getting back to it from time to time, especially because the devs update it regularly and add more content for free (it got less over the last years though).\n\nI think the progression is very well thought-through and very satisfying. With every new playthrough you are ensured to be constantly occupied with things you can do, things that will constantly give you a sense of progression. Research feels meaningful, unlocking vehicles, chaining together rovers and monorails works perfectly and provides satisfying goals to strive for.\n\nThere are so many buildings that work very well together and are just super satisfying to accumulate in your base, to lay them out in a way that they work the best and provide you the greatest benefit is a nice problem-solving kind of experience\n\nThe art-style is unique and fits well into the procedural-generated worlds. In my opinion it synergizes well with the world-reshaping drill gameplay.\n\nOverall its just a neat and chill game you can play at your own pace without much stress or timed goals, where you can enjoy ever-lasting progression and exploration."
        }
      ]
    },
    {
      "title": "Dyson Sphere Program",
      "id": "dyson-sphere-program",
      "date": "March 25, 2024",
      "shortDescription": "A factory building sim on an interplanetary and interstellar scope.",
      "images": [
        {
          "url": "/dsp_1.jpg",
          "title": "Dyson Sphere Program title image, showing the name of the game with a sprawling factory at the front and a dyson sphere in the back."
        },
        {
          "url": "/dsp_2.png",
          "title": "A screenshot from Dyson Sphere Program showing the starter planet with some basic factory lines and energy production."
        },
        {
          "url": "/dsp_3.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a few conveyor belt lines on a desert planet. On the side are assembly lines."
        },
        {
          "url": "/dsp_4.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a couple dozen EM-Rail Ejectors. They are basically magnetic cannons shooting solar sails into a specified orbit around the star."
        },
        {
          "url": "/dsp_5.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a Dyson Sphere in the process of being built. There are already some panels aligned and the star is surrounded by swarms of solar sails on different orbits."
        },
        {
          "url": "/dsp_6.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a planet with massive lines of Solar Sail shooting cannons and rocket launch pads which launch supply rockets for building the Dyson Sphere panels into space."
        },
        {
          "url": "/dsp_7.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a planet fully cluttered with infrastructure to shoot solar sails and supply/construction rockets for the Dyson Sphere into space."
        },
        {
          "url": "/dsp_8.jpg",
          "title": "A screenshot from Dyson Sphere Program showing a planet fully covered in factories with storage units and research labs stacked to insane heights on top of each other."
        }
      ],
      "entries": [
        {
          "title": "Gameplay",
          "description": "Dyson Sphere Program is very similar to Factorio, but extends the scope from just one 2D landscape of one planet, to 3D, to interplanetary and even interstellar logistics. You are a construction robot/mech stranded on a random but peaceful planet. Your task is to harness the resources, build conveyor belts and construction lines to craft items into more and more complex items and to research more and more insane technologies.\n\nWhile doing so, you can move freely around the planet. At first you can only walk, later on you can hover over the land and water. At some point you can leave your planet and visit other plants or moons in your solar system. Later on you are also able to research the warp drive and leave your system to visit other stars and their respective planets. You can even build planetary and interstellar logistic stations to move items around your planet via drones, or to other planets and star system via logistic vessels. That way you can dedicate certain planets for a specific task and then build your web of factories across your galaxy cluster.\n\nAs the name states, your ultimate goal is to build a Dyson Sphere, a giant megastructure around a star which harnesses its energy to almost maximum. For that you will have to slowly build your way up in technology and production progression. At some point you can build Railguns which can shoot solar sails into an orbit around the star. These solar sails will make up dyson swarms and already provide some energy output. The disadvantage is that the solar sails are unable to be maintained and therefore have a limited lifespan. Your energy generation will therefore ultimately be limited to how fast you can shoot new solar sails into orbit. Though as you continue your research you will find out how to build rockets and dyson frames. The rockets will be launched into orbits close to the star and build up structural frames. These frames will 'suck in' the solar sails from the surrounding dyson swarms to build up the dyson sphere panels. All solar sails that are placed into the panels will be maintained forever and will permanently produce energy for you. The energy produced by the dyson sphere and dyson swarms can be received by specific facilities on the planets. You can also use the rays received from the megastructure to build antimatter fuel rods which you can ship through the star cluster to bring the produced energy to wherever you need it.\n\nThere is a feature where you can view other players energy production on a milky way galaxy map. The greater the production of a specific user, the brighter they will appear on the map. This does not have any direct benefits, but is still a nice incentive to push the limits."
        },
        {
          "title": "Why I love this game",
          "description": "When I first played this game I was in awe about every little thing. The User Interface is insanely well made and packed with information. The graphics overall are insanely well made and everything fits well together and it feels unique. The controlls are well done and intuitive, the progression is very well planned... And this game is not even finished yet! As of right now (March 2024) it is still in Early Access and receives constant content updates and features.\n\nBut the most mind-blowing thing about this game is the whole dyson sphere system. When shooting those solar sails into orbit you will see each individual sail in orbit and you can even fly to them and visit the swarm up close. The dyson sphere builder allows for very diverse kind of structures, so you don't have to stick with the plain old square-panel design. You can literally do whatever you want with it (kinda). And just flying through the solar system, seeing those blue flares being shot from your planets which end in an orbit. Seeing the dyson swarm getting more voluminous, seeing rockets start and fly to the star. Seeing the solar sails being sucked into the dyson sphere frame nodes to slowly build up the panels... All of this combined... Sometimes I just had the game open and watched the progress because it was so insanely satisfying. And no other game gave me that kinda satisfaction before."
        }
      ]
    }
]